# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementArray..::..Insert Method
ElementArray Class See Also
---
Insert the specified element into the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	Element item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As Element, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	Element^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ElementThe element to be inserted into the array.
index
    Type: System..::..Int32The element will be inserted before this index.
# ### Return Value
Returns whether the element was inserted into the array.
# See Also
ElementArray Class
Autodesk.Revit.DB Namespace